print("                     🏴Welcome to Treasure Island🏴‍")
print()
print('''*******************************************************************************
          |                   |                  |                     |
 _________|________________.=""_;=.______________|_____________________|_______
|                   |  ,-"_,=""     `"=.|                  |
|___________________|__"=._o`"-._        `"=.______________|___________________
          |                `"=._o`"=._      _`"=._                     |
 _________|_____________________:=._o "=._."_.-="'"=.__________________|_______
|                   |    __.--" , ; `"=._o." ,-"""-._ ".   |
|___________________|_._"  ,. .` ` `` ,  `"-._"-._   ". '__|___________________
          |           |o`"=._` , "` `; .". ,  "-._"-._; ;              |
 _________|___________| ;`-.o`"=._; ." ` '`."\\` . "-._ /_______________|_______
|                   | |o;    `"-.o`"=._``  '` " ,__.--o;   |
|___________________|_| ;     (#) `-.o `"=.`_.--"_o.-; ;___|___________________
____/______/______/___|o;._    "      `".o|o_.--"    ;o;____/______/______/____
/______/______/______/_"=._o--._        ; | ;        ; ;/______/______/______/_
____/______/______/______/__"=._o--._   ;o|o;     _._;o;____/______/______/____
/______/______/______/______/____"=._o._; | ;_.--"o.--"_/______/______/______/_
____/______/______/______/______/_____"=.o|o_.--""___/______/______/______/____
/______/______/______/______/______/______/______/______/______/______/________
******************************************************************************* 
''')



choice1 = input("You are in the middle of a forest🌲,you wanna go left or right ?").lower()
if choice1=="right":
    print("🩸You drop into a deep well😢. Game Over!💀")
elif choice1=="left":
    choice2=input("There is a lake how will you cross it? (swim🏊/boat🚤):")
    if choice2=="swim":
        print("🩸100's of crocodiles🐊 attacked you.Game Over!💀 ")
    elif choice2=="boat":
        choice3 = input("There you see three doors🚪 (red/green/yellow).Which one will you choose ?")
        if choice3=="red":
            print("🩸Not even your bones️🦴 are left,fire🔥 turns you to ash.Game Over!💀")
        elif choice3=="green":
            print("You win! Found a treasure with several jewels📿,diamonds💎")
        elif choice3=="yellow":
            print("🩸Flying spikes🌵 get stuck on your body.Game Over!💀")